app/controllers/appointments_controller.rb

INSERT INTO "appointments" ("client_id", "time", "created_at", "updated_at") VALUES (16, '2025-07-30 09:29:00', '2025-07-17 09:29:59.839112', '2025-07-17 09:29:59.839112') RETURNING "id"
---
def create
  @appointment = Appointment.new(appointment_params)
  if @appointment.save

UPDATE "appointments" SET "time" = '2025-07-30 12:02:00', "updated_at" = '2025-07-17 12:38:34.625560' WHERE "appointments"."id" = 53
---
  def update
    if @appointment.update(appointment_params)

DELETE FROM "appointments" WHERE "appointments"."id" = 53
---
  def destroy
    @appointment.destroy!

SELECT "appointments".* FROM "appointments" WHERE "appointments"."id" = 53 LIMIT 1
---
    def set_appointment
      @appointment = Appointment.find(params.expect(:id))