app/controllers/clients_controller.rb

SELECT "clients".* FROM "clients" WHERE "clients"."id" = 12 LIMIT 1
---
    def set_client
      @client = Client.find(params.expect(:id))